<h3><b>Introduction to Data Analytics - Exercise set 5 - data processing and management</b></h3>

Put all your exercises (Jupyter Notebooks or Python-files) in your course Git-project.
Use either code comments or Jupyter Notebook markdown (text) to document which exercise you are doing and what a certain code section does! 
You can return all of these exercises in a single Jupyter Notebook, if you wish.

<p style="color: red;"><b>NOTE: The JSON/XML –files in Moodle in these exercises have been randomly generated. In other words, the data doesn't make any sense!</b></p>

In [2]:
# import the common data analytics modules
import requests
import json
import xml.etree.ElementTree as et 
from flatten_json import flatten
from bs4 import BeautifulSoup
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

<h4><b>1. </b>Download <b>"simple.json"</b> in Moodle, and load it in pandas.</b> </h4>
<p>
The DataFrame should look like this:
</p>

<img src="http://srv.plab.fi/~tuomasv/data_analytics_2023_images/exercise_set_5/ex51.png" width="1000"/>

In [3]:
df_simple_json = pd.read_json('simple.json')
df_simple_json.head()

,id,brand,model,year,owned_by,acquired,price
0,1,Chrysler,Voyager,2001,Wolff-Trantow,28/12/2016,11565
1,2,Volkswagen,Jetta,1995,"Schuppe, Pfeffer and Klein",20/4/2016,52431
2,3,Porsche,Cayenne,2005,Mante Group,11/6/2020,75552
3,4,Porsche,928,1994,Wisozk Group,17/6/2019,30331
4,5,Mercedes-Benz,SL-Class,2007,Schiller-Littel,20/7/2018,62385

<h4><b>2.</b> Download <b>"simple.xml"</b> in Moodle, and load it in pandas</h4>
<p>
<span style="color: red"><b>(Note:</b> if using pandas.read_xml(), use also the xpath-parameter!)</span><br /><br >The Series should look something like this:
</p>

<img src="http://srv.plab.fi/~tuomasv/data_analytics_2023_images/exercise_set_5/ex52.png" />

<img src="http://srv.plab.fi/~tuomasv/data_analytics_2023_images/exercise_set_5/ex52cars.jpg" width="600" />

In [4]:
df_simple_xml= pd.read_xml('simple.xml', xpath='/*')
df_simple_xml.head()

   id       brand   model  year                    owned_by    acquired  price
0   1  Oldsmobile  Aurora  2003  Herzog, Rodriguez and Howe  21/10/2016  32571

<h4><b>3. Load this API-data into a pandas DataFrame:</b></h4>
<p><a href="https://edu.frostbit.fi/api/events">https://edu.frostbit.fi/api/events</a></p>

<p>
Remember to use json_normalize to help you out with the categories and address information.<br /><b>Have address information in their own columns, and categories as separate rows.</b><br />The DataFrame should look something like this (note that the data changes daily, and exact values will vary):


</p>

<img src="http://srv.plab.fi/~tuomasv/data_analytics_2023_images/exercise_set_5/ex53.png"/>

<img src="http://srv.plab.fi/~tuomasv/data_analytics_2023_images/exercise_set_5/ex53events.jpg" width="600" />

In [5]:
response = json.loads(requests.get('https://edu.frostbit.fi/api/events/').text)
df_events = pd.json_normalize(response)

# Use explode to show categories as separate rows
df_events_exploded = df_events.explode('categories')
df_events_exploded

,name,date,categories,address.street_address,address.postal_code
0,"Taidenäyttely "" Taide on ikuista """,29.4.2024,kulttuuritapahtumat,Untuvaisentie 2,00820
0,"Taidenäyttely "" Taide on ikuista """,29.4.2024,kuvataide,Untuvaisentie 2,00820
0,"Taidenäyttely "" Taide on ikuista """,29.4.2024,näyttelyt,Untuvaisentie 2,00820
1,Kielikahvila,4.4.2024,kulttuuritapahtumat,Ala-Malmin tori 1,00700
2,Kielenvaihtokulma suomi/arabia,3.4.2024,keskustelu,Metsäpurontie 4,00630
3,Runokahvila,22.4.2024,kirjallisuus,Ala-Malmin tori 1,00700
3,Runokahvila,22.4.2024,kulttuuritapahtumat,Ala-Malmin tori 1,00700
3,Runokahvila,22.4.2024,runot,Ala-Malmin tori 1,00700
4,Anna-Sofia Berner ja 10 haavaa Amerikan sydämessä,22.5.2024,kulttuuritapahtumat,Topeliuksenkatu 6,00250
5,Villimarjat -kuoron kevätkonsertti,6.4.2024,konsertit,Hammarskjöldintie 1 A,00250
6,Koululaisten keskiviikot,24.4.2024,kuvataide,Ala-Malmin tori 1,00700
6,Koululaisten keskiviikot,24.4.2024,leikkiminen,Ala-Malmin tori 1,00700
7,Brit Floyd: P·U·L·S·E 2024 World Tour,24.9.2024,konsertit,Nordenskiöldinkatu 11-13,00250
8,Miniroskispaja,9.4.2024,kulttuuritapahtumat,Topeliuksenkatu 6,00250
9,Kaunolukupiiri,14.5.2024,NaN,Ala-Malmin tori 1,00700

<h4><b>4. Use web scraping (e.g. BeautifulSoup), and use it to get the following info from the Rovaniemi Wikipedia –page</b></h4>
<p><b>Wiki-page:</b> <a href="https://en.wikipedia.org/wiki/Rovaniemi">https://en.wikipedia.org/wiki/Rovaniemi</a></p>

<b>Tasks:</b>
<ul>
    <li>Get the coordinates of Rovaniemi (upper right corner)</li>
    <li>Get the nickname of Rovaniemi (under coat of arms)</li>
</ul>

<b>Advanced extra tasks:</b>
<ul>
    <li><b>Get the total population</b></li>
    <ul>
        <li><b>Note:</b> this is a good example why webscraping can be tedious, since you'll have to traverse the HTML-tree to get what you want. This might be helpful:<br />
<a href="https://realpython.com/beautiful-soup-web-scraper-python/">https://realpython.com/beautiful-soup-web-scraper-python/</a></li>
    </ul>
    
</ul>

<ul>
    <li><b>Get the total area</b></li>
    <ul>
        <li>Convert this number into a float decimal (i.e. remove commas and the unit and call float() –in Python!)</li>
    </ul>
    
</ul>

<img src="http://srv.plab.fi/~tuomasv/data_analytics_2023_images/exercise_set_5/ex54rovaniemi.jpg" width="600" />

In [6]:
url = 'https://en.wikipedia.org/wiki/Rovaniemi'
page = requests.get(url)
soup = BeautifulSoup(page.content,'html.parser')

# Get the coordinates from the Wikipedia page
coordinates = soup.find(id='coordinates').text
coordinates.replace('\ufeff','').strip()

'Coordinates: 66°30′N 025°44′E / 66.500°N 25.733°E / 66.500; 25.733'

In [7]:
# Get the nickname of the city
nickname = soup.find(class_='ib-settlement-nickname nickname').text
nickname.strip()

'Arctic Capital; Hometown of Santa Claus'

In [8]:
# Get the total population of the city
elem1 = soup.find_all('tr', class_='mergedrow')

for elem in elem1:
    if 'Total' in elem.text:
        population = elem.find('td', class_='infobox-data').text
        population = population.replace(',', '')
        if population.isnumeric():    
            print(f'Total population: {population}')

Total population: 65285

In [9]:
# Get the total area of the city
for elem in elem1:
    if 'Total' in elem.text:
        area = elem.find('td', class_='infobox-data').text
        if 'km2' in area: 
            area = area.split(' ')[0]
            area = area.replace(',', '').replace('km2','')
            area = float(area)   
            print(f'Total area: {area} km2')

Total area: 8016.75 km2

<h4><b>5. Use web scraping, and create a DataFrame of this table: </b></h4>
<p> <a href="https://en.wikipedia.org/wiki/List_of_countries_by_average_yearly_temperature">https://en.wikipedia.org/wiki/List_of_countries_by_average_yearly_temperature</a></p>

<ul>
    <li>Change the name of the value column to "avg_temp" as well (pandas column rename)</li>
</ul>

<b>Advanced extra task:</b>
<ul>
    <li><b>Scrape these two tables as well</b></li>
    <ul>
        <li><a href="https://en.wikipedia.org/wiki/List_of_countries_by_employment_rate">https://en.wikipedia.org/wiki/List_of_countries_by_employment_rate</a></li>
        <li><a href="https://en.wikipedia.org/wiki/List_of_countries_by_unemployment_rate">https://en.wikipedia.org/wiki/List_of_countries_by_unemployment_rate</a></li>
    </ul>
    <br />
    <ul>
        <li><b>Combine the tables into a single DataFrame so that you get only the data of year 2020 or newer, and have the columns <span style="color: darkorange">"Country", "EmploymentRate"</span> and <span style="color: darkorange">"UnemploymentRate"</span>. You can also create additional columns <span style="color: red">"EmploymentRate15_24"</span>and <span style="color: red">" EmploymentRate25_70"</span> if you scrape the OECD-table as well! </b>

</li>
    </ul>
</ul>

In [10]:
url = 'https://en.wikipedia.org/wiki/List_of_countries_by_average_yearly_temperature'
data_countries = pd.read_html(url)
df_countries = data_countries[0]
df_countries.rename(columns={'Temperature (°C)': 'avg_temp'}, inplace=True)
df_countries.head()

        Country             avg_temp
0  Burkina Faso  28.29 °C (82.92 °F)
1          Mali  28.25 °C (82.85 °F)
2      Kiribati  28.20 °C (82.76 °F)
3      Djibouti  28.00 °C (82.40 °F)
4      Maldives  28.00 °C (82.40 °F)

In [11]:
url = 'https://en.wikipedia.org/wiki/List_of_sovereign_states_by_employment_rate'
data_countries_employment = pd.read_html(url)
df_countries_employment = data_countries_employment[0]
df_countries_employment.head()

         Country  Rate (%)   Ages  Year   Source
0        Iceland      81.9  15–64  2021  OECD[5]
1    Netherlands      80.8  15–64  2021  OECD[5]
2    Switzerland      80.1  15–64  2021  OECD[5]
3  New Zealand *      79.2  15–64  2021  OECD[5]
4          Japan      78.0  15–64  2021  OECD[5]

In [12]:
url = 'https://en.wikipedia.org/wiki/List_of_sovereign_states_by_unemployment_rate'
data_countries_unemployment = pd.read_html(url)
df_countries_unemployment = data_countries_unemployment[0]
df_countries_unemployment.head()

            Country  Unemployment rate (%) Source/date of information
0     Afghanistan *                   13.3                   [4] 2021
1         Albania *                   11.7                [5] Q1 2022
2         Algeria *                   12.7                   [4] 2021
3  American Samoa *                   18.0                   [6] 2012
4         Andorra *                    3.7                   [7] 2016

In [13]:
# Clean up the employment data and keep only the most recent years
df_employment = df_countries_employment.drop(columns=['Ages', 'Source'])
df_employment.rename(columns={'Rate (%)': 'Employment rate (%)'}, inplace=True)
df_employment['Year'] = df_employment['Year'].iloc[-1].strip()
df_employment = df_employment[df_employment['Year'].astype(int) >= 2020]
df_employment = df_employment.drop(columns=['Year'])
df_employment.head()

         Country  Employment rate (%)
0        Iceland                 81.9
1    Netherlands                 80.8
2    Switzerland                 80.1
3  New Zealand *                 79.2
4          Japan                 78.0

In [14]:
# Clean up the unemployment data and keep only the most recent years
df_unemployment = df_countries_unemployment
df_unemployment.rename(columns={'Source/date of information': 'Year'}, inplace=True)
df_unemployment['Year'] = df_unemployment['Year'].iloc[-1].strip()[-4:]
df_unemployment = df_unemployment[df_unemployment['Year'].astype(int) >= 2020]
df_unemployment = df_unemployment.drop(columns=['Year'])
df_unemployment.head()

            Country  Unemployment rate (%)
0     Afghanistan *                   13.3
1         Albania *                   11.7
2         Algeria *                   12.7
3  American Samoa *                   18.0
4         Andorra *                    3.7

In [15]:
# Combine the dataframes
df_employment_unemployment = df_employment.merge(df_unemployment, left_on='Country', right_on='Country', how='left')
df_employment_unemployment.dropna(inplace=True)
df_employment_unemployment

             Country  Employment rate (%)  Unemployment rate (%)
3      New Zealand *                 79.2                    3.3
7          Denmark *                 76.5                    4.5
8           Sweden *                 76.0                    7.7
9   United Kingdom *                 75.5                    3.5
10       Australia *                 75.3                    3.4
11           China *                 75.1                    5.4
13         Estonia *                 75.0                    5.7
14          Canada *                 74.7                    5.8
15         Hungary *                 73.9                    3.0
16           Malta *                 73.8                    3.0
17         Finland *                 73.5                    6.7
22          Russia *                 72.2                    3.9
23        Portugal *                 71.0                    6.1
24          Poland *                 70.9                    2.7
25   United States *                 70.5                    3.9
26        Slovakia *                 70.5                    6.0
31        Bulgaria *                 68.5                    4.3
33          France *                 67.7                    7.2
34     South Korea *                 67.2                    2.9
35         Belgium *                 66.0                    5.5
38           Spain *                 63.8                   11.6
39         Croatia *                 62.0                    6.1
40          Mexico *                 61.9                    3.3
42           Chile *                 60.2                    7.8
44          Greece *                 59.2                   12.3
47          Brazil *                 56.7                    7.5
49          Turkey *                 51.7                   10.3
50           India *                 49.0                    7.8
55    South Africa *                 36.5                   32.1

<img src="http://srv.plab.fi/~tuomasv/data_analytics_2023_images/exercise_set_5/ex55stocks.jpg" width="450" />

<h4><b>6. Simple merging:</b> Download <u><b>coffee_sales.csv</b></u> and <b><u>temperatures_fixed.csv</u></b> from Moodle.<b></h4>
<p>Use merging to combine these files into one DataFrame, containing the coffee sales data and the corresponding temperature –data. (merge(), see materials for examples)</p>

<span style="color: red;"><b>Use left join, and coffee sales as the first DataFrame!</b></span>

In [16]:
df_coffee_sales = pd.read_csv('coffee_sales.csv')
df_temperatures_fixed = pd.read_csv('temperatures_fixed.csv')
df_merged = df_coffee_sales.merge(df_temperatures_fixed, left_on='Date', right_on='Date', how='left')

# Merge the dataframes
df_merged.head()

        Date  Sales  Target_sales  Total_expenses  Temperature (C)
0  1.10.2012    122            90              76        19.822917
1  1.10.2012    123            90              45        19.822917
2  2.10.2012    107            90              36        19.020602
3  3.10.2012     94           100              21        15.820139
4  4.10.2012    182            80              54        15.110648

<b>Extra task: </b> Do the same but with <b>temperatures_unfixed.csv</b> instead. Remember <b>groupby()</b> before attempting merging! 

<b>Also, you might want to remove some of the columns before grouping data => <span style="color: red;">Summary + Hour</span>. </b>

<span><i>You can also try to merge the DataFrames so that the Summary –of the weather is also added. For this, you probably need to figure out first how to determine the "average" Summary for each day (extra challenge!).</i></span>

In [17]:
# "average" summary for each day
def average_summary_all(summaries):
    avg = ''

    for summary in summaries:
        if 'Cloudy' in summary and 'Cloudy' not in avg:
            avg += 'Cloudy, '
        if 'Overcast' in summary and 'Overcast' not in avg:
            avg += 'Overcast, '
        if 'Clear' in summary and 'Clear' not in avg:
            avg += 'Clear, '
        if 'Rain' in summary and 'Rainy' not in avg:
            avg += 'Rainy, '
        if 'Drizzle' in summary and 'Rainy' not in avg:
            avg += 'Drizzle, '
        if 'Windy' in summary and 'Windy' not in avg:
            avg += 'Windy, '
        if 'Breezy' in summary and 'Windy' not in avg:
            avg += 'Breezy, '
        if 'Foggy' in summary and 'Foggy' not in avg:
            avg += 'Foggy, '
        if 'Humid' in summary and 'Humid' not in avg:
            avg += 'Humid, '
        if 'Dry' in summary and 'Dry' not in avg:
            avg += 'Dry, '
    
    return avg[:-2]

In [18]:
df_temperatures_unfixed = pd.read_csv('temperatures_unfixed.csv')

# Clean up the temperature data
df_temperatures_unfixed.drop(columns=['Hour'], inplace=True)

# Group by date and calculate the mean temperature
df_temperatures_unfixed = df_temperatures_unfixed.groupby('Date').agg({'Temperature (C)': 'mean', 'Summary': average_summary_all}).reset_index()

# Merge the dataframes
df_merged2 = df_coffee_sales.merge(df_temperatures_unfixed, left_on='Date', right_on='Date', how='left')
df_merged2.head()

,Date,Sales,Target_sales,Total_expenses,Temperature (C),Summary
0,1.10.2012,122,90,76,19.822917,Cloudy
1,1.10.2012,123,90,45,19.822917,Cloudy
2,2.10.2012,107,90,36,19.020602,"Cloudy, Foggy, Overcast"
3,3.10.2012,94,100,21,15.820139,"Cloudy, Overcast, Clear"
4,4.10.2012,182,80,54,15.110648,"Clear, Foggy, Cloudy"

<img src="http://srv.plab.fi/~tuomasv/data_analytics_2023_images/exercise_set_5/ex56coffee.jpg" width="450" />


<h2><b>Advanced extra tasks for extra points (varying challenges, some require Googling):</b></h2>

<ul>
<li><b>1. Download the "complex.json" –file from Moodle.</b> Note that this data is fairly complex (i.e. heavily nested). Use json_normalize and other needed methods to convert this data into a workable DataFrame.</li>
</ul>

In [33]:
json_file = open("complex.json", "r")
response_raw = json_file.read()
json_file.close()
response = json.loads(response_raw)

# Normalize the JSON data
normalized_json_df = pd.json_normalize(response)
normalized_json_df.head()

,id,brand,model,year,price,ownership.company,ownership.acquired,ownership.payment_info.credit_card,ownership.payment_info.iban
0,1,Ford,F250,1997,72213,Johns and Sons,24/10/2017,jcb,SA47 315V KYTA 8FVT NCGN MM7G
1,2,Dodge,Grand Caravan,1999,42370,"Crist, Hyatt and Leannon",7/6/2020,instapayment,FR74 8157 1767 53I2 VRAN ZMIB U11
2,3,Audi,A5,2011,19191,Bosco and Sons,23/11/2018,jcb,LB32 4989 VCVZ S5BZ X2CT JKG3 QRAW
3,4,Hyundai,Veracruz,2012,21956,Haley Inc,5/6/2016,bankcard,BE62 4961 0596 5774
4,5,Chevrolet,TrailBlazer,2009,53066,"Zulauf, Nolan and Franecki",14/1/2021,jcb,FR11 1768 5506 10IU QVPN XU2H O88

<ul>
<li><b>2. Load the "simple.json" –file without pandas, and try to get the average price with plain Python. </li>
</ul>

In [34]:
json_file = open("simple.json", "r")
response_raw = json_file.read()
json_file.close()
response = json.loads(response_raw)

sum = 0
for res in response:
    sum += res['price']
avg_price = sum / len(response)
print(f'Average price: {avg_price}')

Average price: 42373.86